/*



This file contains advanced configuration for SoGMAPI. You generally shouldn't change this file.
The default values are mirrored in StardewModdingAPI.Framework.Models.SConfig to log custom changes.


This file is overwritten each time you update or reinstall SoGMAPI. To avoid losing custom settings,
create a 'config.user.json' file in the same folder with *only* the settings you want to change.
That file won't be overwritten, and any settings in it will override the default options. Don't
copy all the settings, or you may cause bugs due to overridden changes in future SoGMAPI versions.



*/
{
    /**
     * Whether SoGMAPI should log more information about the game context.
     */
    "VerboseLogging": false,

    /**
     * Whether SoGMAPI should check for newer versions of SoGMAPI and mods when you load the game. If new
     * versions are available, an alert will be shown in the console. This doesn't affect the load
     * time even if your connection is offline or slow, because it happens in the background.
     */
    "CheckForUpdates": true,

    /**
     * Whether to enable features intended for mod developers. Currently this only makes TRACE-level
     * messages appear in the console.
     */
    "DeveloperMode": true,

    /**
     * Whether SoGMAPI should rewrite mods for compatibility. This may prevent older mods from
     * loading, but bypasses a Visual Studio crash when debugging.
     */
    "RewriteMods": true,

    /**
     * Whether to enable more aggressive memory optimizations.
     * If you get frequent 'OutOfMemoryException' errors, you can try enabling this to reduce their
     * frequency. This may cause crashes for farmhands in multiplayer.
     */
    "AggressiveMemoryOptimizations": false,

    /**
     * Whether to add a section to the 'mod issues' list for mods which directly use potentially
     * sensitive .NET APIs like file or shell access. Note that many mods do this legitimately as
     * part of their normal functionality, so these warnings are meaningless without further
     * investigation.
     *
     * When this is commented out, it'll be true for local debug builds and false otherwise.
     */
    //"ParanoidWarnings": true,

    /**
     * Whether SoGMAPI should show newer beta versions as an available update.
     *
     * When this is commented out, it'll be true if the current SoGMAPI version is beta, and false
     * otherwise.
     */
    //"UseBetaChannel": true,

    /**
     * SoGMAPI's GitHub project name, used to perform update checks.
     */
    "GitHubProjectName": "Nauja/SoGMAPI",

    /**
     * Stardew64Installer's GitHub project name, used to perform update checks.
     */
    "Stardew64InstallerGitHubProjectName": "Steviegt6/Stardew64Installer",

    /**
     * The base URL for SoGMAPI's web API, used to perform update checks.
     * Note: the protocol will be changed to http:// on Linux/macOS due to OpenSSL issues with the
     * game's bundled Mono.
     */
    "WebApiBaseUrl": "https://SoGMAPI.io/api/",

    /**
     * Whether SoGMAPI should log network traffic (may be very verbose). Best combined with VerboseLogging, which includes network metadata.
     */
    "LogNetworkTraffic": false,

    /**
     * The colors to use for text written to the SoGMAPI console.
     *
     * The possible values for 'UseScheme' are:
     *  - AutoDetect: SoGMAPI will assume a light background on macOS, and detect the background color
     *    automatically on Linux or Windows.
     *  - LightBackground: use darker text colors that look better on a white or light background.
     *  - DarkBackground: use lighter text colors that look better on a black or dark background.
     *  - None: disables all colors, so everything is written in the default terminal color.
     *
     * For available color codes, see https://docs.microsoft.com/en-us/dotnet/api/system.consolecolor.
     *
     * (These values are synched with ColorfulConsoleWriter.GetDefaultColorSchemeConfig in the
     * SoGMAPI code.)
     */
    "ConsoleColors": {
        "UseScheme": "AutoDetect",

        "Schemes": {
            "DarkBackground": {
                "Trace": "DarkGray",
                "Debug": "DarkGray",
                "Info": "White",
                "Warn": "Yellow",
                "Error": "Red",
                "Alert": "Magenta",
                "Success": "DarkGreen"
            },
            "LightBackground": {
                "Trace": "DarkGray",
                "Debug": "DarkGray",
                "Info": "Black",
                "Warn": "DarkYellow",
                "Error": "Red",
                "Alert": "DarkMagenta",
                "Success": "DarkGreen"
            }
        }
    },

    /**
     * The mod IDs SoGMAPI should ignore when performing update checks or validating update keys.
     */
    "SuppressUpdateChecks": [
        "SoGMAPI.ConsoleCommands",
        "SoGMAPI.ErrorHandler",
        "SoGMAPI.SaveBackup"
    ]
}
